Revit 2027 API
Wall.GetHostWallId Method
 Gets the element ID of the host wall that this wall is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHostWallId()
Public Function GetHostWallId As ElementId
public:
ElementId^ GetHostWallId()
member GetHostWallId : unit -> ElementId
Return Value
ElementId
 The element ID of the host wall that this wall is associated with, or invalidElementId if the wall is not associated with any host wall.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace